Tekla Open API Reference for Tekla Structures 2025
AnalysisSubSection.R1 Property
 The R1 value.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double R1 { get; set; }
Public Property R1 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnalysisSubSection Class
Tekla.Structures.Analysis Namespace